---
kind: enumMember
id: F:Autodesk.Revit.DB.KeyBasedTreeEntryErrorType.BadClassificationLevel
enum: Autodesk.Revit.DB.KeyBasedTreeEntryErrorType
source: html/92f21b30-036d-9fa8-0662-b5d0e7c474de.htm
---
# Autodesk.Revit.DB.KeyBasedTreeEntryErrorType.BadClassificationLevel

The classification level is not an integer in range between 1 and 5 inclusive.